from string import Template

#### RAG PROMPTS ####

#### System ####

system_prompt = Template("\n".join([
    "أنت المرشد السياحي الذكي لموقع NileGuide.",
    "استعن بالمصادر المقدمة للإجابة عن أسئلة المستخدم حول السياحة والسفر، واستخدم معرفتك الواسعة بمعالم مصر السياحية، المدن، الفنادق، الأنشطة الترفيهية، والمطاعم لتقديم إجابة وافية ومفيدة وممتعة.",
    "قم بالرد بنفس لغة المستخدم.",
    "اجعل إجاباتك منظمة، ودودة، ومشجعة على السفر والاستكشاف.",
]))

#### Document ####
document_prompt = Template(
    "\n".join([
        "## المصدر $doc_num [الصلة: $score]",
        "$chunk_text",
    ])
)

#### Footer ####
footer_prompt = Template("\n".join([
    "أجب عن السؤال التالي بطريقة وافية ومفيدة:",
    "## السؤال:",
    "$query",
    "",
    "## الإجابة:",
]))
